from typing import Dict


class FaqDef:
    DEFINITIONS: Dict[str, Dict] = {
        "восстановление": {
            "title": "Восстановление",
            "aliases": [
                "будут восстанавливать город",
                "будут восстанавливать припять",
                "будут восстанавливать чернобыль",
                "восстановят город",
                "восстановят припять",
                "восстановят чернобыль",
            ],
            "answer": "Город не подлежит восстановлению. Незачем, не на что, некому, ни одной объективной причины это делать.",
            "tags": ["восстановление", "город"],
        },
        "экскурсии": {
            "title": "Экскурсии в Зону отчуждения",
            "aliases": [
                "проводятся экскурсии в зоне отчуждения",
                "проводятся поездки в зоне отчуждения",
                "есть экскурсии в зоне отчуждения",
                "есть поездки в зоне отчуждения",
                "как туда попасть",
                "как попасть в чернобыль",
                "как попасть в припять",
            ],
            "answer": "С февраля 2022 года поездок в украинскую часть Зоны отчуждения нет, и, скорее всего, не будет в ближайшее время. Есть поездки в ПГРЭЗ, это со стороны Беларуси.",
            "tags": ["экскурсии", "зона", "поездка"],
        },
        "причина аварии": {
            "title": "Причина аварии",
            "aliases": [
                "почему произошла катастрофа",
                "почему произошла авария",
                "почему произошел взрыв",
                "почему случилась катастрофа",
                "почему случилась авария",
                "почему случился взрыв",
                "кто виноват в аварии",
                "кто виноват в катастрофе",
                "кто виноват во взрыве",
            ],
            "answer": (
                "Причины в порядке убывания: критические недостатки в конструкции реактора с многочисленными"
                " нарушениями правил ядерной безопасности, недостатки в документации о разных режимах работы и"
                " поведении реактора на тех или иных режимах, приведение персоналом реактора в нестабильное состояние"
                " и стечение обстоятельств. Такая авария могла произойти где угодно и когда угодно на любом из"
                " реакторов РБМК до 1986 года."
            ),
            "tags": ["причина", "авария", "катастрофа", "взрыв", "виноват"],
        },
        "пожарные": {
            "title": "Пожарные после взрыва",
            "aliases": ["что делали пожарные после взрыва"],
            "answer": (
                "Первым прибыл караул Правика. Будучи РТП-1 (руководитель тушения пожара), он приказал"
                " своим бойцам подниматься на крышу машзала, сам уйдя в разведку. Позже приехал караул из"
                " СВПЧ-6, Правик приказал им остаться на северной стороне. Кибенок развернул АЛ-30 у 3 блока,"
                " его бойцы поднялись по ней на крышу ВСРО, после чего было подано два ствола Б на крышу блока B"
                " (там, где ВТ-2 стояла). Когда стало понятно, что бойцы СВПЧ-6 не справляются - Правик взял"
                " своего водителя и один направился на помощь своему товарищу, лейтенанту Кибенку. Скорее всего,"
                " из-за этого маневра погиб и сам Правик, ведь все бойцы под его командованием остались живы."
                " Далее все начали по-одному выходить из строя."
            ),
            "tags": ["пожарные", "авария", "катастрофа", "взрыв"],
        },
        "разрушения": {
            "title": "Разрушения зданий",
            "aliases": [
                "какие здания в припяти уже обрушились",
                "какие здания в припяти уже рухнули",
                "какие здания в припяти уже развалились",
                "какие здания в припяти обрушились",
                "какие здания в припяти рухнули",
                "какие здания в припяти развалились",
            ],
            "answer": (
                "Школа №1 — рухнули две секции здания и крыша, магазин 'Книги' — от сырости очень быстро рушится"
                " крыша и прилегающая стена, завод 'Юпитер' — рухнула крыша в одном из цехов, магазин 'Березка'"
                " — не выдержал снежной зимы и 'сложился', торговый павильон припятского рынка."
            ),
            "tags": ["разрушения", "припять", "здания", "обрушения", "рухнули", "развалились"],
        },
        "население": {
            "title": "Население до аварии",
            "aliases": [
                "сколько людей жило в чернобыле до аварии",
                "сколько людей жило в припяти до аварии",
                "сколько людей жило до аварии",
                "сколько людей жило там до аварии",
                "сколько было население припяти до аварии?",
                "сколько было население чернобыля до аварии?",
                "сколько людей переселили?",
                "сколько людей отселили?",
                "сколько людей вывезли?",
                "сколько людей эвакуировали?",
                "сколько людей переселили из припяти?",
                "сколько людей отселили из припяти?",
                "сколько людей вывезли из припяти?",
                "сколько людей эвакуировали из припяти?",
                "сколько людей переселили из чернобыля?",
                "сколько людей отселили из чернобыля?",
                "сколько людей вывезли из чернобыля?",
                "сколько людей эвакуировали из чернобыля?",
                "сколько людей переселили из чзо?",
                "сколько людей отселили из чзо?",
                "сколько людей вывезли из чзо?",
                "сколько людей эвакуировали из чзо?",
            ],
            "answer": "До аварии в Чернобыле проживало около 13 тысяч человек. В Припяти — около пятидесяти. В сумме с выселенными деревнями и хуторами при эвакуации вышло около 130 тысяч человек.",
            "tags": ["население", "жители", "до аварии", "до взрыва", "до катастрофы", "сколько людей", "сколько человек", "сколько было", "из припяти", "из чернобыля"],
        },
        "животные": {
            "title": "Животные в зоне отчуждения",
            "aliases": [
                "живут ли животные в зоне отчуждения",
                "какие животные живут в зоне отчуждения",
            ],
            "answer": "В зоне отчуждения живут различные виды животных, включая лис, волков, медведей и других. Некоторые виды, такие как лоси и кабаны, процветают в отсутствие людей. Также в зоне обитают редкие виды птиц и насекомых.",
            "tags": ["животные", "зона отчуждения"],
        },
        "сейчас живут": {
            "title": "Живут ли люди сейчас",
            "aliases": [
                "живет кто-нибудь в чернобыле сейчас",
                "живет кто-нибудь в припяти сейчас",
                "живет кто-то в чернобыле сейчас",
                "живет кто-то в припяти сейчас",
                "живет кто то в чернобыле сейчас",
                "живет кто то в припяти сейчас",
                "живет кто то там сейчас",
                "живет кто нибудь в чернобыле сейчас",
                "живет кто нибудь в припяти сейчас",
                "кто нибудь живет в припяти",
                "в припяти кто нибудь живет",
                "кто нибудь живет в чернобыле",
                "живет кто нибудь там сейчас",
                "живет кто в припяти",
                "живет кто в чернобыле",
                "живет кто там",
                "живут люди в припяти",
                "живут люди в чернобыле",
                "живут люди там",
            ],
            "answer": "В Чернобыле живет вахтовым методом около двух тысяч человек. В деревнях на окраине зоны несколько десятков самоселов, но их все меньше. В Припяти никто не живет.",
            "tags": ["население", "жизнь"],
        },
        "погибло": {
            "title": "Погибшие",
            "aliases": [
                "сколько человек погибло",
                "там погиб кто-нибудь",
                "там погиб кто нибудь",
                "там погиб кто-то",
                "там погиб кто то",
                "сколько человек умерло",
                "там умер кто-нибудь",
                "там умер кто нибудь",
                "там умер кто-то",
                "там умер кто то",
            ],
            "answer": "Непосредственно во время взрыва погиб 1 человек, Ходемчук Валерий Ильич. В тот же день умер еще один — Шашенок Владимир Николаевич. В течение трёх месяцев от облучения умерло еще 28 пожарных и работников станции. Официально подтвержденных жертв аварии — около четырех тысяч.",
            "tags": ["жертвы", "погибшие", "умершие"],
        },
        "разница": {
            "title": "Разница Чернобыля и Припяти",
            "aliases": [
                "что такое чернобыль и припять",
                "чем отличается чернобыль и припять",
                "чем отличается припять от чернобыля",
                "в чем разница между чернобылем и припятью",
            ],
            "answer": "Чернобыль основан в 13 веке и был небольшой город. Припять — город, построенный специально как город-спутник АЭС, основан в 1970 году, население на момент аварии — почти 50 тысяч человек. После аварии был построен город Славутич для бывших припятчан.",
            "tags": ["города", "разница"],
        },
        "критмасса": {
            "title": "Критическая масса",
            "aliases": [
                "что такое критическая масса",
            ],
            "answer": "Критическая масса это минимальное количество делящегося вещества (например, урана-235 или плутония-239), необходимое для начала самоподдерживающейся цепной реакции деления",
            "tags": ["физика", "реактор"],
        },
        "деаэратор": {
            "title": "Деаэратор",
            "aliases": [
                "что такое деаэратор",
            ],
            "answer": "Деаэратор — устройство для удаления растворённых газов, в основном кислорода и углекислого газа, из воды, используемое в системах водоподачи и конденсационных установках.",
            "tags": ["физика", "блок", "газы"],
        },
        "нейтрон": {
            "title": "Нейтрон",
            "aliases": [
                "что такое нейтрон",
            ],
            "answer": "Нейтрон — нейтральная частица, входящая в состав атомного ядра. Нейтроны, их количество, энергия и распределение играют важнейшую роль в процессах деления и самоподдерживающейся цепной реакции.",
            "tags": ["физика", "частица", "атом"],
        },
        "работает станция": {
            "title": "Работает ли станция",
            "aliases": ["работает сейчас станция"],
            "answer": "Нет, станция не генерирует электроэнергию. После пожара в 1991 году второй блок был остановлен, затем первый и третий блоки были сняты с эксплуатации. Сейчас станция работает как энергоузел и предприятие по обращению с радиоактивными отходами.",
            "tags": ["станция", "работа"],
        },
        "аз-5": {
            "title": "АЗ-5",
            "aliases": ["кто нажал аз-5", "кто нажал аз 5", "кто нажал кнопку аз"],
            "answer": "Достоверно не известно. Разные свидетели указывают на Александра Акимова или Леонида Топтунова.",
            "tags": ["аз-5", "оператор"],
        },
        "жить": {
            "title": "Можно ли жить",
            "aliases": ["можно жить в припяти", "можно жить в чернобыле", "можно жить там"],
            "answer": "Нет, нельзя. Во-первых, это опасно для здоровья. Во-вторых, там нет инфраструктуры для жизни — ни магазинов, ни аптек, ни поликлиник, ни школ, ни детских садов, ни работы. В-третьих, это запрещено законом.",
            "tags": ["жизнь", "медицина", "здоровье", "закон", "запрет"],
        },
        "чзо": {
            "title": "ЧЗО",
            "aliases": ["чзо", "чернобыльская зона отчуждения", "зона отчуждения"],
            "answer": "ЧЗО - Чернобыльская зона отчуждения. Украинская сторона Зоны отчуждения.",
            "tags": ["термин", "зона"],
        },
        "буряковка": {
            "title": "Буряковка",
            "aliases": ["буряковка"],
            "answer": (
                "Буряковка - это село в Зоне отчуждения, расположенное в 12 км к северо-западу"
                " от Чернобыля. После аварии село было эвакуировано и заброшено. Рядом располагается"
                " одноимённый Пункт захоронения радиоактивных отходов Буряковка."
            ),
            "tags": ["населённый пункт", "термин"],
        },
        "рассоха": {
            "title": "Рассоха",
            "aliases": ["рассоха", "россоха", "расоха", "росоха"],
            "answer": (
                "Пункт временной локализации радиоактивных отходов (отстойник) Рассоха находится в"
                " 7 км к юго-западу от Чернобыля. Предназначен для временного хранения радиоактивных отходов"
                " низкой и средней активности."
            ),
            "tags": ["термин", "отходы"],
        },
        "рбмк": {
            "title": "РБМК",
            "aliases": ["рбмк", "реактор большой мощности канальный"],
            "answer": (
                "РБМК - реактор большой мощности канальный. Тип ядерного реактора, использовавшийся на"
                " Чернобыльской АЭС и других. Отличается использованием графитового замедлителя и"
                " водяного охлаждения."
            ),
            "tags": ["техника", "реактор"],
        },
        "кориум": {
            "title": "Кориум",
            "aliases": ["кориум", "слоновая нога", "слоновья нога"],
            "answer": (
                "Кориум - расплавленное ядерное топливо, смесь расплавленных тепловыделяющих сборок,"
                " технологических каналов и других материалов, находившихся в активной зоне реактора."
            ),
            "tags": ["термин", "топливо"],
        },
        "кбо": {
            "title": "КБО",
            "aliases": ["кбо", "комбинат бытового обслуживания"],
            "answer": "Комбинат бытового обслуживания. Там располагались ателье, прачечные, парикмахерские и др.",
            "tags": ["инфраструктура"],
        },
        "абк": {
            "title": "АБК",
            "aliases": ["абк", "абк-1", "абк-2", "абк 1", "абк 2", "административно-бытовой корпус"],
            "answer": "АБК - административно-бытовой корпус.",
            "tags": ["здание"],
        },
        "нвт": {
            "title": "НВТ",
            "aliases": ["нвт", "новая вентиляционная труба"],
            "answer": "Новая вентиляционная труба. Её поставили на замену ВТ-2 в 2012 году.",
            "tags": ["оборудование"],
        },
        "вт-2": {
            "title": "вт-2",
            "aliases": ["вт", "вентиляционная труба", "вт-2", "вт-1"],
            "answer": "Вентиляционные трубы первой и второй очередей. Первая стоит до сих пор. Вторая была демонтирована в ноябре 2013 года.",
            "tags": ["оборудование"],
        },
        "озр": {
            "title": "ОЗР",
            "aliases": ["озр"],
            "answer": "ОЗР - оперативный запас реактивности. Вычисляемая величина, количественно означает возможность маневрирования мощностью реактора в положительную или отрицательную сторону. Чем больше ОЗР, тем легче управлять реактором, тем он стабильнее. Измеряется в условных 'стержнях РР', не путать с физическими СУЗ РР.",
            "tags": ["термин", "реактор"],
        },
        "СУЗ": {
            "title": "СУЗ",
            "aliases": ["суз", "стержни суз"],
            "answer": ("СУЗ - Стержни Управления и Защиты."
            "В реакторе их 211 штук различных типов: 24 штуки АЗ (аварийной защиты),"
            "119 штук РР (ручного регулирования),"
            "24 штуки УСП (укороченные стержни-поглотители, вводятся снизу),"
            "12 штук АР (автоматического регулирования),"
            "12 штук ЛАР (локального автоматического регулирования),"
            "и 24 ПК-АЗ(ЛАЗ) - перекомпенсации или локальной автоматической защиты."),
            "tags": ["термин", "реактор"],
        },
        "дуга": {
            "title": "Дуга",
            "aliases": [
                "что такое дуга",
                "что такое згрлс",
                "зачем нужна згрлс",
                "зачем нужна дуга",
            ],
            "answer": "ЗГРЛС 'Дуга' — это система радиолокационного обнаружения, предназначенная для раннего предупреждения о запуске межконтинентальных баллистических ракет. Позиций на каждый комплекс две - передающая и принимающая. В Чернобыле-2 находится принимающая антенна. Передающая располагалась в Любеч-1. Таких комплексов было три: в Чернобыле, Комсомольске-на-Амуре и Николаеве. На настоящий момент уцелела только принимающая антенна в Чернобыле.",
            "tags": ["военное", "дуга", "згрлс", "радар", "антенна"],
        },
        "информация": {
            "title": "информация",
            "aliases": [
                "посоветуйте фильмы",
                "посоветуйте что посмотреть",
                "посоветуйте что-нибудь посмотреть",
                "посоветуйте книги",
                "посоветуйте что почитать",
                "посоветуйте что-нибудь почитать",
                "откуда вы все это знаете?"
            ],
            "answer": ("Почитать:\n"
            "- <a href='https://vk.com/s/v1/doc/1Axy5SIbrWLA4HTE2UlyYkWq50E_F7Q-qlAWykvn3IxnSwzPFuQ'>Шигапов А. 'Чернобыль, Припять, далее нигде.'</a>\n"
            "- Паскевич С., Вишневский Д. 'Чернобыль Реальный мир'. Пиратки нет, можно купить на Озоне\n"
            "- <a href='https://vk.com/s/v1/doc/fEynw_0a-_HcWBsXVsFYFU-Bey4NzUxZL_-AJEmtiOodHfVO00I'>Дятлов А.С. 'Чернобыль. Как это было.'</a>\n"
            "- <a href='https://vk.com/s/v1/doc/uR8CFdFbxm9kDWlS7VAhb5Q_pYNqedp9TC7t2slVprSc49mBj_M'>Щербак Ю.Н. 'Чернобыль.'</a>\n"
            "- <a href='https://vk.com/s/v1/doc/IrjAxxvxq4RS_G4s3DMugdKkpL_tuwJIXKgwLcc_8xFgpZavEq4'>Карпан Н.В. 'Месть мирного атома.'</a>\n\n"
            "Посмотреть:\n"
            "- <a href='https://vk.com/videos-792329?section=album_1'>Хроника аварии на 4 блоке ЧАЭС</a>\n"
            "- <a href='https://vk.com/videos-792329?section=album_2'>Чернобыль. Как это было. Две части</a>\n"
            "- <a href='https://vkvideo.ru/video-792329_456240586'>Чернобыль. 3828</a>\n\n"
            "<a href='https://vk.com/topic-792329_54430455'>Ссылка на большой справочник</a>\n"
            "<a href='https://vk.com/docs-792329'>Ссылка на книги в паблике ВК</a>"
            ),
            "tags": ["информация", "книги", "фильмы", "посоветуйте"],
        },
    }
