# -*- coding: utf-8 -*-
# Reviewed: December 14, 2025
from __future__ import annotations


class faq:
    """Frequently Asked Questions and their answers."""
    questions: dict = {
        # 1
        "Будут восстанавливать город?": 1, "Будут восстанавливать Припять?": 1,
        "Будут восстанавливать Чернобыль?": 1, "Восстановят город?": 1,
        "Восстановят Припять?": 1, "Восстановят Чернобыль?": 1, "Когда будут Припять восстанавливать": 1,
        # 2
        "Проводятся экскурсии в Зону отчуждения?": 2, "Проводятся поездки в Зону отчуждения?": 2,
        "Есть экскурсии в Зону отчуждения?": 2, "Есть поездки в Зону отчуждения?": 2,
        "Как туда попасть?": 2, "Как попасть в Чернобыль?": 2, "Как попасть в Припять?": 2,
        # 3
        "Почему произошла катастрофа?": 3, "Почему произошла авария?": 3, "Почему произошел взрыв?": 3,
        "Почему случилась катастрофа?": 3, "Почему случилась авария?": 3, "Почему случился взрыв?": 3,
        "Кто виноват в аварии?": 3, "Кто виноват в катастрофе?": 3, "Кто виноват во взрыве?": 3,
        # 4
        "Что такое Дуга?": 4, "Что это за антенна?": 4, "Зачем нужна Дуга?": 4, "Зачем нужна антенна?": 4,
        "Что такое ЗГРЛС?": 4, "Что это за ЗГРЛС?": 4, "Зачем нужна ЗГРЛС?": 4,
        # 5
        "Что делали пожарные после взрыва?": 5,
        # 6
        "Какие здания в Припяти уже обрушились?": 6, "Какие здания в Припяти уже рухнули?": 6,
        "Какие здания в Припяти уже развалились?": 6,
        # 7
        "Сколько людей жило в Чернобыле до аварии?": 7, "Сколько людей жило в Припяти до аварии?": 7,
        "Сколько людей жило до аварии?": 7, "Сколько людей жило там до аварии?": 7,
        # 8
        "Живет кто-нибудь в Чернобыле сейчас?": 8, "Живет кто-нибудь в Припяти сейчас?": 8,
        "Живет кто-то в Чернобыле сейчас?": 8, "Живет кто-то в Припяти сейчас?": 8,
        "Живет кто то в Чернобыле сейчас?": 8, "Живет кто то в Припяти сейчас?": 8,
        "Живет кто то там сейчас?": 8, "Живет кто нибудь в Чернобыле сейчас?": 8,
        "Живет кто нибудь в Припяти сейчас?": 8, "Живет кто нибудь там сейчас?": 8,
        "Живет кто в Припяти?": 8, "Живет кто в Чернобыле?": 8, "Живет кто там?": 8,
        "Живут люди в Припяти?": 8, "Живут люди в Чернобыле?": 8, "Живут люди там?": 8,
        # 9
        "Сколько человек погибло?": 9, "Там погиб кто-нибудь?": 9,
        "Там погиб кто нибудь?": 9, "Там погиб кто-то?": 9, "Там погиб кто то?": 9,
        "Сколько человек умерло?": 9, "Там умер кто-нибудь?": 9, "Там умер кто нибудь?": 9,
        "Там умер кто-то?": 9, "Там умер кто то?": 9,
        # 10
        "Что такое Чернобыль и Припять?": 10, "Чем отличается Чернобыль и Припять?": 10, "Чем отличается Припять от Чернобыля?": 10, "В чем разница между Чернобылем и Припятью?": 10,
        # 11
        "Работает сейчас станция?": 11,
        # 12
        "Кто нажал АЗ-5?": 12, "Кто нажал АЗ 5?": 12, "Кто нажал кнопку АЗ?": 12,
        # 13
        "Можно жить в Припяти?": 13, "Можно жить в Чернобыле?": 13, "Можно жить там?": 13,
        # 14
        "Что такое Буряковка?": 14,
        # 15
        "Что такое Рассоха?": 15, "Что такое Россоха?": 15, "Что такое Расоха?": 15, "Что такое Росоха?": 15,
        # 16
        "Что такое ПВЛРО?": 16,
        # 17
        "Что такое ПЗРО?": 17,
        # 18
        "Что такое РБМК?": 18,
        # 19
        "Что такое кориум?": 19, "Что такое слоновая нога?": 19, "Что такое слоновья нога?": 19,
        # 20
        "Что такое ХЖТО?": 20,
        # 21
        "Что такое ПГРЭЗ?": 21,
        # 22
        "Что такое Рыжий лес?": 22,
        # 23
        "Кто такой СИУР?": 23, "Кто такой ВИУР?": 23, "Что такое СИУР?": 23, "Что такое ВИУР?": 23,
        # 24
        "Кто такой СИУТ?": 24, "Кто такой ВИУТ?": 24, "Что такое СИУТ?": 24, "Что такое ВИУТ?": 24,
        # 25
        "Кто такой СИУБ?": 25, "Кто такой ВИУБ?": 25, "Что такое СИУБ?": 25, "Что такое ВИУБ?": 25,
        # 26
        "Кто такой НСС?": 26, "Кто такой НСС?": 26, "Что такое НСС?": 26,
        # 27
        "Кто такой НСБ?": 27, "Кто такой НСБ?": 27, "Что такое НСБ?": 27,
        # 28
        "Что такое ПУСО?": 28,
        # 29
        "Что такое ЧЗО?": 29,
        # 30
        "Что такое КБО?": 30,
        # 31
        "Что такое АБК?": 31,
        # 32
        "Что такое ППР?": 32,
        # 33
        "Что такое НБК?": 33,
        # 34
        "Что такое ПОК?": 34,
    }

    answers: dict = {
        1: "Город не подлежит восстановлению. Незачем, не на что, некому, ни одной объективной причины это делать.",
        2: "С февраля 2022 года поездок в украинскую часть Зоны отчуждения нет, и, скорее всего, не будет в ближайшее время. Есть поездки в ПГРЭЗ, это со стороны Беларуси.",
        3: "Причины в порядке убывания: критические недостатки в конструкции реактора с многочисленными нарушениями правил ядерной безопасности, недостатки в документации о различных режимах работы и поведении реактора на тех или иных режимах, приведение персоналом реактора в нестабильное состояние, стечение обстоятельств. На самом деле такая авария могла произойти где угодно и когда угодно на любом из реакторов РБМК до 1986 года.",
        4: "Загоризонтная радиолокационная станция (ЗГРЛС) 'Дуга' проекта 5Н32 предназначалась для раннего обнаружения массированного запуска межконтинентальных баллистических ракет. Принимающая антенна расположена в военном городке Чернобыль-2, активная - в Любече (снесена). Было три косплекса и на данный момент чернобыльская антенна единственная, которая уцелела.",
        5: "Первым прибыл караул Правика. Будучи РТП-1 (руководитель тушения пожара), он приказал своим бойцам подниматься на крышу машзала, сам уйдя в разведку. Позже приехал караул из СВПЧ-6, Правик приказал им остаться на северной стороне. Кибенок развернул АЛ-30 у 3 блока, его бойцы поднялись по ней на крышу ВСРО, после чего было подано два ствола Б на крышу блока В (там, где ВТ-2 стояла). Когда стало понятно, что бойцы СВПЧ-6 не справляются - Правик взял своего водителя и один направился на помощь своему товарищу, лейтенанту Кибенку. Скорее всего, из-за этого маневра погиб и сам Правик, ведь все бойцы под его командованием остались живы. Далее все начали по-одному выходить из строя.",
        6: "Школа №1 - рухнули две секции здания и крыша, магазин 'Книги' - от сырости очень быстро рушится крыша и прилегающая стена, завод 'Юпитер' - рухнула крыша в одном из цехов, магазин 'Березка' - не выдержал снежной зимы и 'сложился', торговый павильон припятского рынка.",
        7: "До аварии в Чернобыле проживало около 13 тысяч человек. В Припяти - около пятидесяти. В сумме с выселенными деревнями и хуторами при эвакуации вышло около 130 тысяч человек.",
        8: "В Чернобыле живет вахтовым методом около двух тысяч человек. Месяц пожили-поработали - уехали отдыхать на месяцок. В деревнях на окраине зоны несколько десятков самоселов, но их все меньше. В Припяти никто не живет.",
        9: "Непосредственно во время взрыва погиб 1 человек, Ходемчук Валерий Ильич, старший оператор ГЦН. В этот же день от травм и ожогов в больнице скончался еще один - Шашенок Владимир Николаевич, инженер-наладчик систем автоматики ЧПНП. В течение трёх месяцец от облучения умерло еще 28 пожарных и работников станции. Официально подтвержденных жертв аварии - около четырех тысяч.",
        10: "Чернобыль основан в 13 веке, это был небольшой город с населением в 13 тысяч человек на момент аварии. Всё отношение к аварии, которое он имеет - его именем названа станция. Припять - город, построенный специально как город-спутник АЭС. Основан в 1970 году, население на момент аварии - почти 50 тысяч человек. После аварии в спешном порядке был построен город Славутич, где сейчас живет большая часть припятчан.",
        11: "Нет, станция не генерирует электроэнергию. После пожара в 1991 на втором блоке было принято решение о его остановке. Затем под давлением мировой общественности было принято решение о досрочном снятии с эксплуатации первого и третьего блоков. Первый блок был остановлен в 1996. Третий - в 2000. В данный момент станция работает как энергоузел и предприятие по обращению с радиоактивными отходами.",
        12: "Достоверно не известно. Разные свидетели указывают на Александра Акимова или Леонида Топтунова.",
        13: "Нет, нельзя. Во-первых, это опасно для здоровья. Во-вторых, там нет инфраструктуры для жизни - ни магазинов, ни аптек, ни поликлиник, ни школ, ни детских садов, ни работы. В-третьих, это запрещено законом.",
        14: "Буряковка - это село в Зоне отчуждения, расположенное в 12 км к северо-западу от Чернобыля. После аварии на ЧАЭС в 1986 году село было эвакуировано и заброшено. Рядом располагается одноимённый Пункт захоронения радиоактивных отходов Буряковка.",
        15: "Пункт временной локализации радиоактивных отходов (отстойник) Рассоха находится в 7 км к юго-западу от Чернобыля. Предназначен для временного хранения радиоактивных отходов низкой и средней активности, образующихся в процессе эксплуатации Чернобыльской АЭС и других предприятий атомной энергетики Украины.",
        16: "Пункт временной локализации радиоактивных отходов.",
        17: "Пункт захоронения радиоактивных отходов.",
        18: "РБМК - реактор большой мощности канальный. Тип ядерного реактора, использовавшийся на Чернобыльской АЭС, Ленинградской, Смоленской и Курской АЭС. На Игналинской АЭС использовалась модификация РБМК-1500. Число после названия это электрическая мощность блока. Отличительной особенностью РБМК является использование графитового замедлителя и водяного охлаждения.",
        19: "Кориум - расплавленное ядерное топливо, образовавшееся в результате аварии на ЧАЭС. Представляет собой смесь расплавленных тепловыделяющих сборок, технологических каналов и других материалов, находившихся в активной зоне реактора во время аварии. Кориум обладает крайне высокой радиоактивностью и тепловыделением, что делает его опасным для окружающей среды и здоровья человека.",
        20: "ХЖТО - хранилище жидких и твёрдых отходов.",
        21: "ПГРЭЗ - Полесский Государственный Радиационно-Зкологический Заповедник. Белорусская сторона Зоны отчуждения.",
        22: "Рыжий лес - это около 200 квадратных километров леса возле Чернобыльской АЭС к западу от станции. Высокая доза поглощённой радиации во время аварии привела к гибели деревьев (преимущественно сосен) полностью или к гибели их хвои. В результате лес \"порыжел\", как осенний лиственный. Во время работ по дезактивации территории погибший лес был снесён бульдозерами и захоронен в траншеи, а остальной восстановился сам.",
        23: "СИУР (ВИУР) - старший (ведущий) инженер управления реактором.",
        24: "СИУТ (ВИУТ) - старший (ведущий) инженер управления турбинами.",
        25: "СИУБ (ВИУБ) - старший (ведущий) инженер управления блоком.",
        26: "НСС - начальник смены станции.",
        27: "НСБ - начальник смены блока.",
        28: "ПУСО - пункт санитарной обработки. На данных пунктах производилась дезактивация (мытьё) транспорта и техники.",
        29: "ЧЗО - Чернобыльская зона отчуждения. Украинская сторона Зоны отчуждения.",
        30: "КБО - Комбинат бытового обслуживания. Там располагались ателье, прачечные, парикмахерские и другие подобные службы.",
        31: "АБК - Административно-бытовой корпус.",
        32: "ППР - Планово-предупредительный ремонт.",
        33: "НБК - Новый безопасный конфайнмент. Ограждающая конструкция, возведённая над саркофагом для обеспечения дополнительной защиты от распространения радиоактивных веществ.",
        34: "ПОК - Промышленно-отопительная котельная.",
    }
